/*Задача 9. Използвайте do-while цикъл, за да напишете функцията void
itoa(int n, char s[ ]), която преобразува число в символен низ (обратната
функция на atoi). do-while цикълът e необходим, тъй като в масива s[ ] ще
трябва да се постави поне един символ, дори ако n е нула. Ако n = 123, за
да вземем последната цифра, трябва да разделим n по модул(%) на
основата на бройната система 10. За да получите чаръктър число, трябва
да съберете резултата с '0' т.е. 48. За да вземете следващото число, трябва
да разделите n на 10. Това продължава докато n е различно от нула. Това
генерира низа в обратен ред – 321, затова използваме функцията
reverse(char s[]); от задача 18 , за да обърнем низа.*/
#include<stdio.h>
#include<string.h>
void reverse(char s[]){
    for(int i=strlen(s);i>=0;i--){
        printf("%c",s[i]);
    }
    printf("\n");
   
}
int atoi(int *a,char s[]){
    int i,sign;
    if((sign=*a)<0){
        *a=-*a;
        i=0;
        do{
            s[i++]=*a%10+'0';
            printf("%d\n",*a%10);
        }while((*a/=10)>0);
        if(sign<0){
            s[i++]='-';
            s[i]='\0';
            reverse(s);
        }
    }
}
int main(){
    int a=123;
    char array[15];
    atoi(&a,array);
    printf("%c\n",array);
    return 0;
}